ConnectTest/src/Enums/СтатусыСообщений/СтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСообщений</name>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>НеОтправлено</name>
  </enumValues>
  <enumValues>
    <name>Доставлено</name>
  </enumValues>
  <enumValues>
    <name>НеДоставлено</name>
  </enumValues>
  <enumValues>
    <name>Прочитано</name>
  </enumValues>
</mdclass:Enum>

ConnectTest/src/CommonModules/ИнтеграцияСIDMkg/Module.bsl
Функция ОтправитьСМС(Параметры, Ответ) Экспорт
	
	HTTPСоединение	= Новый HTTPСоединение(Параметры.Сервер, Параметры.Порт,,,, Параметры.Таймаут, ?(Параметры.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено), Параметры.ИспользоватьАутентификациюОС);	
	
	URL	= "SmsService.svc/SendSms?login=" + Параметры.Пользователь + "&password=" + Параметры.Пароль + "&phone=" + Параметры.НомерТелефона + "&body=" + Параметры.Текст + "&senderName=" + Параметры.ИмяОтправителя;
	ЗапросHTTP	= Новый HTTPЗапрос(URL);
	ОтветHTTP	= HTTPСоединение.Получить(ЗапросHTTP);
	ТелоЗапроса	= СокрЛП(ОтветHTTP.ПолучитьТелоКакСтроку());
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТелоЗапроса);
	ТекущийПуть = "";
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.Имя = "string" Тогда
				ТекущийПуть = "string";
			КонецЕсли;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			Если ТекущийПуть = "string" Тогда
				sms_id = ЧтениеXML.Значение;
				ТекущийПуть = "";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Если sms_id <> "" Тогда
		Ответ.Вставить("ИД", sms_id);
		Ответ.Вставить("СтатусСообщения", Перечисления.СтатусыСообщений.Отправлено);		
	Иначе
		Ответ.Вставить("Ошибка", "Сбой при отрправке сообщения");		
	КонецЕсли;
	
	Ответ.Вставить("Период", УниверсальноеВремя(ТекущаяДата()));
	
	Возврат Ответ;	
	
КонецФункции

Функция ПроверитьСтатусСМС(Параметры, Ответ) Экспорт
	
	HTTPСоединение	= Новый HTTPСоединение(Параметры.Сервер, Параметры.Порт,,,, Параметры.Таймаут, ?(Параметры.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено), Параметры.ИспользоватьАутентификациюОС);	
	
	URL	= "SmsService.svc/GetMessageState?login=" + Параметры.Пользователь + "&password=" + Параметры.Пароль + "&messageid=" + Параметры.ИД;
	ЗапросHTTP	= Новый HTTPЗапрос(URL);
	ОтветHTTP	= HTTPСоединение.Получить(ЗапросHTTP);
	ТелоЗапроса	= СокрЛП(ОтветHTTP.ПолучитьТелоКакСтроку());

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТелоЗапроса);
	ТекущийПуть = "";
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.Имя = "Comment" Тогда
				ТекущийПуть = "Comment";
			КонецЕсли;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			Если ТекущийПуть = "Comment" Тогда
				ОтветСтатус = ЧтениеXML.Значение;
				ТекущийПуть = "";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Статус	= СтатусСообщения(ОтветСтатус);
	Если ТипЗнч(Статус) = Тип("ПеречислениеСсылка.СтатусыСообщений") Тогда
		Ответ.Вставить("СтатусСообщения", Статус);
	Иначе
		Ответ.Вставить("СтатусСообщения", Перечисления.СтатусыСообщений.НеДоставлено);
		Ответ.Вставить("Ошибка","Неизвестный статус");
	КонецЕсли;
	
	Ответ.Вставить("Период", УниверсальноеВремя(ТекущаяДата()));
	
	Возврат Ответ;
	
КонецФункции

Функция СтатусСообщения(Статус)
	
	Если Статус = "В очереди" Или Статус = "Отправлено" Или Статус = "Подготовлено" Или Статус = "Создано" Тогда
		Возврат Перечисления.СтатусыСообщений.Отправлено;
	ИначеЕсли Статус = "Отклонено" Тогда
		Возврат Перечисления.СтатусыСообщений.НеОтправлено;
	ИначеЕсли Статус = "Доставлено" Тогда
		Возврат Перечисления.СтатусыСообщений.Доставлено;
	ИначеЕсли Статус = "Не доставлено" Или Статус = "Просрочено" Тогда
		Возврат Перечисления.СтатусыСообщений.НеДоставлено;
	Иначе
		Возврат Статус;
	КонецЕсли;
	
КонецФункции
